
a.out:     file format elf64-s390

SYMBOL TABLE:
0000000000000238 l    d  .interp	0000000000000000              .interp
0000000000000248 l    d  .note.gnu.build-id	0000000000000000              .note.gnu.build-id
000000000000026c l    d  .note.ABI-tag	0000000000000000              .note.ABI-tag
0000000000000290 l    d  .gnu.hash	0000000000000000              .gnu.hash
00000000000002b8 l    d  .dynsym	0000000000000000              .dynsym
0000000000000480 l    d  .dynstr	0000000000000000              .dynstr
0000000000000556 l    d  .gnu.version	0000000000000000              .gnu.version
0000000000000580 l    d  .gnu.version_r	0000000000000000              .gnu.version_r
00000000000005c0 l    d  .rela.dyn	0000000000000000              .rela.dyn
00000000000009e0 l    d  .rela.plt	0000000000000000              .rela.plt
0000000000000b18 l    d  .init	0000000000000000              .init
0000000000000b58 l    d  .plt	0000000000000000              .plt
0000000000000d18 l    d  .text	0000000000000000              .text
00000000000011d0 l    d  .fini	0000000000000000              .fini
0000000000001200 l    d  .rodata	0000000000000000              .rodata
0000000000001428 l    d  .eh_frame_hdr	0000000000000000              .eh_frame_hdr
0000000000001470 l    d  .eh_frame	0000000000000000              .eh_frame
0000000000002cb0 l    d  .init_array	0000000000000000              .init_array
0000000000002cb8 l    d  .fini_array	0000000000000000              .fini_array

  DW_CFA_offset: r14 at cfa-48
  DW_CFA_offset: r15 at cfa-40
  DW_CFA_advance_loc: 6 to 0000000000001164
  DW_CFA_def_cfa_offset: 320
  DW_CFA_advance_loc: 40 to 000000000000118c
  DW_CFA_restore: r15
  DW_CFA_restore: r14
  DW_CFA_restore: r13
  DW_CFA_restore: r12
  DW_CFA_restore: r11
  DW_CFA_def_cfa_offset: 160
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

0000011c 000000000000001c 000000f0 FDE cie=00000030 pc=0000000000001190..00000000000011ca
  DW_CFA_advance_loc: 6 to 0000000000001196
  DW_CFA_offset: r14 at cfa-48
  DW_CFA_offset: r15 at cfa-40
  DW_CFA_advance_loc: 6 to 000000000000119c
  DW_CFA_def_cfa_offset: 320
  DW_CFA_advance_loc: 44 to 00000000000011c8
  DW_CFA_restore: r15
  DW_CFA_restore: r14
  DW_CFA_def_cfa_offset: 160

0000013c ZERO terminator


Contents of the .debug_aranges section (loaded from a.out):

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000000e10 00000000000003ba
    0000000000000000 0000000000000000

Contents of the .debug_info section (loaded from a.out):

  Compilation Unit @ offset 0:
   Length:        0x9fe (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  8
 <0><c>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x31c): GNU C99 12.2.0 -march=z196 -m64 -mzarch -g -O1 -std=gnu99 -fasynchronous-unwind-tables
    <11>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0xdb): ../morse.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2ba): /root/hello-world/s390-linux-gnu
    <1a>   DW_AT_low_pc      : 0xe10
    <22>   DW_AT_high_pc     : 0x3ba
    <2a>   DW_AT_stmt_list   : 0
 <1><2e>: Abbrev Number: 4 (DW_TAG_base_type)
    <2f>   DW_AT_byte_size   : 8
    <30>   DW_AT_encoding    : 4	(float)
    <31>   DW_AT_name        : (indirect string, offset: 0xf2): double
 <1><35>: Abbrev Number: 8 (DW_TAG_typedef)
    <36>   DW_AT_name        : (indirect string, offset: 0x26): size_t
    <3a>   DW_AT_decl_file   : 2
    <3b>   DW_AT_decl_line   : 214
    <3c>   DW_AT_decl_column : 23
    <3d>   DW_AT_type        : <0x41>
 <1><41>: Abbrev Number: 4 (DW_TAG_base_type)
    <42>   DW_AT_byte_size   : 8
    <43>   DW_AT_encoding    : 7	(unsigned)
    <44>   DW_AT_name        : (indirect string, offset: 0x55): long unsigned int
 <1><48>: Abbrev Number: 4 (DW_TAG_base_type)
    <49>   DW_AT_byte_size   : 8
    <4a>   DW_AT_encoding    : 5	(signed)
    <4b>   DW_AT_name        : (indirect string, offset: 0x76): long int
 <1><4f>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <50>   DW_AT_byte_size   : 8
 <1><51>: Abbrev Number: 4 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 1
    <53>   DW_AT_encoding    : 8	(unsigned char)
    <54>   DW_AT_name        : (indirect string, offset: 0x233): unsigned char
 <1><58>: Abbrev Number: 4 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 2
    <5a>   DW_AT_encoding    : 7	(unsigned)
    <5b>   DW_AT_name        : (indirect string, offset: 0x13b): short unsigned int
 <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 4
    <61>   DW_AT_encoding    : 7	(unsigned)
    <62>   DW_AT_name        : (indirect string, offset: 0x5a): unsigned int
 <1><66>: Abbrev Number: 4 (DW_TAG_base_type)
    <67>   DW_AT_byte_size   : 1
    <68>   DW_AT_encoding    : 6	(signed char)
    <69>   DW_AT_name        : (indirect string, offset: 0x235): signed char
 <1><6d>: Abbrev Number: 4 (DW_TAG_base_type)
    <6e>   DW_AT_byte_size   : 2
    <6f>   DW_AT_encoding    : 5	(signed)
    <70>   DW_AT_name        : (indirect string, offset: 0x241): short int
 <1><74>: Abbrev Number: 28 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4
    <76>   DW_AT_encoding    : 5	(signed)
    <77>   DW_AT_name        : int
 <1><7b>: Abbrev Number: 12 (DW_TAG_const_type)
    <7c>   DW_AT_type        : <0x74>
 <1><80>: Abbrev Number: 8 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0): __off_t
    <85>   DW_AT_decl_file   : 3
    <86>   DW_AT_decl_line   : 152
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x48>
 <1><8c>: Abbrev Number: 8 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x287): __off64_t
    <91>   DW_AT_decl_file   : 3
    <92>   DW_AT_decl_line   : 153
    <93>   DW_AT_decl_column : 27
    <94>   DW_AT_type        : <0x48>
 <1><98>: Abbrev Number: 8 (DW_TAG_typedef)
    <99>   DW_AT_name        : (indirect string, offset: 0x2db): __time_t
    <9d>   DW_AT_decl_file   : 3
    <9e>   DW_AT_decl_line   : 160
    <9f>   DW_AT_decl_column : 26
    <a0>   DW_AT_type        : <0x48>
 <1><a4>: Abbrev Number: 8 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x19c): __syscall_slong_t
    <a9>   DW_AT_decl_file   : 3
    <aa>   DW_AT_decl_line   : 197
    <ab>   DW_AT_decl_column : 33
    <ac>   DW_AT_type        : <0x48>
 <1><b0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b1>   DW_AT_byte_size   : 8
    <b1>   DW_AT_type        : <0xb5>
 <1><b5>: Abbrev Number: 4 (DW_TAG_base_type)
    <b6>   DW_AT_byte_size   : 1
    <b7>   DW_AT_encoding    : 8	(unsigned char)
    <b8>   DW_AT_name        : (indirect string, offset: 0x23c): char
 <1><bc>: Abbrev Number: 12 (DW_TAG_const_type)
    <bd>   DW_AT_type        : <0xb5>
 <1><c1>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c2>   DW_AT_name        : (indirect string, offset: 0x1d9): _IO_FILE
    <c6>   DW_AT_byte_size   : 216
    <c7>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 49
    <c9>   DW_AT_decl_column : 8
    <c9>   DW_AT_sibling     : <0x247>
 <2><cd>: Abbrev Number: 2 (DW_TAG_member)
    <ce>   DW_AT_name        : (indirect string, offset: 0xbc): _flags
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 51
    <d4>   DW_AT_decl_column : 7
    <d5>   DW_AT_type        : <0x74>
    <d9>   DW_AT_data_member_location: 0
 <2><da>: Abbrev Number: 2 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x8): _IO_read_ptr
    <df>   DW_AT_decl_file   : 4
    <e0>   DW_AT_decl_line   : 54
    <e1>   DW_AT_decl_column : 9
    <e2>   DW_AT_type        : <0xb0>
    <e6>   DW_AT_data_member_location: 8
 <2><e7>: Abbrev Number: 2 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0xaf): _IO_read_end
    <ec>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 55
    <ee>   DW_AT_decl_column : 9
    <ef>   DW_AT_type        : <0xb0>
    <f3>   DW_AT_data_member_location: 16
 <2><f4>: Abbrev Number: 2 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x291): _IO_read_base
    <f9>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 56
    <fb>   DW_AT_decl_column : 9
    <fc>   DW_AT_type        : <0xb0>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 2 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x378): _IO_write_base
    <106>   DW_AT_decl_file   : 4
    <107>   DW_AT_decl_line   : 57
    <108>   DW_AT_decl_column : 9
    <109>   DW_AT_type        : <0xb0>
    <10d>   DW_AT_data_member_location: 32
 <2><10e>: Abbrev Number: 2 (DW_TAG_member)
    <10f>   DW_AT_name        : (indirect string, offset: 0x12d): _IO_write_ptr
    <113>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 58
    <115>   DW_AT_decl_column : 9
    <116>   DW_AT_type        : <0xb0>
    <11a>   DW_AT_data_member_location: 40
 <2><11b>: Abbrev Number: 2 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x1ae): _IO_write_end
    <120>   DW_AT_decl_file   : 4
    <121>   DW_AT_decl_line   : 59
    <122>   DW_AT_decl_column : 9
    <123>   DW_AT_type        : <0xb0>
    <127>   DW_AT_data_member_location: 48
 <2><128>: Abbrev Number: 2 (DW_TAG_member)
    <129>   DW_AT_name        : (indirect string, offset: 0x43): _IO_buf_base
    <12d>   DW_AT_decl_file   : 4
    <12e>   DW_AT_decl_line   : 60
    <12f>   DW_AT_decl_column : 9
    <130>   DW_AT_type        : <0xb0>
    <134>   DW_AT_data_member_location: 56
 <2><135>: Abbrev Number: 2 (DW_TAG_member)
    <136>   DW_AT_name        : (indirect string, offset: 0xc3): _IO_buf_end
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 61
    <13c>   DW_AT_decl_column : 9
    <13d>   DW_AT_type        : <0xb0>
    <141>   DW_AT_data_member_location: 64
 <2><142>: Abbrev Number: 2 (DW_TAG_member)
    <143>   DW_AT_name        : (indirect string, offset: 0x14e): _IO_save_base
    <147>   DW_AT_decl_file   : 4
    <148>   DW_AT_decl_line   : 64
    <149>   DW_AT_decl_column : 9
    <14a>   DW_AT_type        : <0xb0>
    <14e>   DW_AT_data_member_location: 72
 <2><14f>: Abbrev Number: 2 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x2f9): _IO_backup_base
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 65
    <156>   DW_AT_decl_column : 9
    <157>   DW_AT_type        : <0xb0>
    <15b>   DW_AT_data_member_location: 80
 <2><15c>: Abbrev Number: 2 (DW_TAG_member)
    <15d>   DW_AT_name        : (indirect string, offset: 0x29f): _IO_save_end
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 66
    <163>   DW_AT_decl_column : 9
    <164>   DW_AT_type        : <0xb0>
    <168>   DW_AT_data_member_location: 88
 <2><169>: Abbrev Number: 2 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0x203): _markers
    <16e>   DW_AT_decl_file   : 4
    <16f>   DW_AT_decl_line   : 68
    <170>   DW_AT_decl_column : 22
    <171>   DW_AT_type        : <0x260>
    <175>   DW_AT_data_member_location: 96
 <2><176>: Abbrev Number: 2 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x15): _chain
    <17b>   DW_AT_decl_file   : 4
    <17c>   DW_AT_decl_line   : 70
    <17d>   DW_AT_decl_column : 20
    <17e>   DW_AT_type        : <0x265>
    <182>   DW_AT_data_member_location: 104
 <2><183>: Abbrev Number: 2 (DW_TAG_member)
    <184>   DW_AT_name        : (indirect string, offset: 0x97): _fileno
    <188>   DW_AT_decl_file   : 4
    <189>   DW_AT_decl_line   : 72
    <18a>   DW_AT_decl_column : 7
    <18b>   DW_AT_type        : <0x74>
    <18f>   DW_AT_data_member_location: 112
 <2><190>: Abbrev Number: 2 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x16a): _flags2
    <195>   DW_AT_decl_file   : 4
    <196>   DW_AT_decl_line   : 73
    <197>   DW_AT_decl_column : 7
    <198>   DW_AT_type        : <0x74>
    <19c>   DW_AT_data_member_location: 116
 <2><19d>: Abbrev Number: 2 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0xf9): _old_offset
    <1a2>   DW_AT_decl_file   : 4
    <1a3>   DW_AT_decl_line   : 74
    <1a4>   DW_AT_decl_column : 11
    <1a5>   DW_AT_type        : <0x80>
    <1a9>   DW_AT_data_member_location: 120
 <2><1aa>: Abbrev Number: 2 (DW_TAG_member)
    <1ab>   DW_AT_name        : (indirect string, offset: 0xcf): _cur_column
    <1af>   DW_AT_decl_file   : 4
    <1b0>   DW_AT_decl_line   : 77
    <1b1>   DW_AT_decl_column : 18
    <1b2>   DW_AT_type        : <0x58>
    <1b6>   DW_AT_data_member_location: 128
 <2><1b7>: Abbrev Number: 2 (DW_TAG_member)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x26c): _vtable_offset
    <1bc>   DW_AT_decl_file   : 4
    <1bd>   DW_AT_decl_line   : 78
    <1be>   DW_AT_decl_column : 15
    <1bf>   DW_AT_type        : <0x66>
    <1c3>   DW_AT_data_member_location: 130
 <2><1c4>: Abbrev Number: 2 (DW_TAG_member)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x2d): _shortbuf
    <1c9>   DW_AT_decl_file   : 4
    <1ca>   DW_AT_decl_line   : 79
    <1cb>   DW_AT_decl_column : 8
    <1cc>   DW_AT_type        : <0x26a>
    <1d0>   DW_AT_data_member_location: 131
 <2><1d1>: Abbrev Number: 2 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x15c): _lock
    <1d6>   DW_AT_decl_file   : 4
    <1d7>   DW_AT_decl_line   : 81
    <1d8>   DW_AT_decl_column : 15
    <1d9>   DW_AT_type        : <0x27a>
    <1dd>   DW_AT_data_member_location: 136
 <2><1de>: Abbrev Number: 2 (DW_TAG_member)
    <1df>   DW_AT_name        : (indirect string, offset: 0xfd): _offset
    <1e3>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 89
    <1e5>   DW_AT_decl_column : 13
    <1e6>   DW_AT_type        : <0x8c>
    <1ea>   DW_AT_data_member_location: 144
 <2><1eb>: Abbrev Number: 2 (DW_TAG_member)
    <1ec>   DW_AT_name        : (indirect string, offset: 0xe9): _codecvt
    <1f0>   DW_AT_decl_file   : 4
    <1f1>   DW_AT_decl_line   : 91
    <1f2>   DW_AT_decl_column : 23
    <1f3>   DW_AT_type        : <0x284>
    <1f7>   DW_AT_data_member_location: 152
 <2><1f8>: Abbrev Number: 2 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x24e): _wide_data
    <1fd>   DW_AT_decl_file   : 4
    <1fe>   DW_AT_decl_line   : 92
    <1ff>   DW_AT_decl_column : 25
    <200>   DW_AT_type        : <0x28e>
    <204>   DW_AT_data_member_location: 160
 <2><205>: Abbrev Number: 2 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0x30e): _freeres_list
    <20a>   DW_AT_decl_file   : 4
    <20b>   DW_AT_decl_line   : 93
    <20c>   DW_AT_decl_column : 20
    <20d>   DW_AT_type        : <0x265>
    <211>   DW_AT_data_member_location: 168
 <2><212>: Abbrev Number: 2 (DW_TAG_member)
    <213>   DW_AT_name        : (indirect string, offset: 0x118): _freeres_buf
    <217>   DW_AT_decl_file   : 4
    <218>   DW_AT_decl_line   : 94
    <219>   DW_AT_decl_column : 9
    <21a>   DW_AT_type        : <0x4f>
    <21e>   DW_AT_data_member_location: 176
 <2><21f>: Abbrev Number: 2 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0x2b3): __pad5
    <224>   DW_AT_decl_file   : 4
    <225>   DW_AT_decl_line   : 95
    <226>   DW_AT_decl_column : 10
    <227>   DW_AT_type        : <0x35>
    <22b>   DW_AT_data_member_location: 184
 <2><22c>: Abbrev Number: 2 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x172): _mode
    <231>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 96
    <233>   DW_AT_decl_column : 7
    <234>   DW_AT_type        : <0x74>
    <238>   DW_AT_data_member_location: 192
 <2><239>: Abbrev Number: 2 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x2e4): _unused2
    <23e>   DW_AT_decl_file   : 4
    <23f>   DW_AT_decl_line   : 98
    <240>   DW_AT_decl_column : 8
    <241>   DW_AT_type        : <0x293>
    <245>   DW_AT_data_member_location: 196
 <2><246>: Abbrev Number: 0
 <1><247>: Abbrev Number: 8 (DW_TAG_typedef)
    <248>   DW_AT_name        : (indirect string, offset: 0x1dd): FILE
    <24c>   DW_AT_decl_file   : 5
    <24d>   DW_AT_decl_line   : 7
    <24e>   DW_AT_decl_column : 25
    <24f>   DW_AT_type        : <0xc1>
 <1><253>: Abbrev Number: 29 (DW_TAG_typedef)
    <254>   DW_AT_name        : (indirect string, offset: 0x1c5): _IO_lock_t
    <258>   DW_AT_decl_file   : 4
    <259>   DW_AT_decl_line   : 43
    <25a>   DW_AT_decl_column : 14
 <1><25b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <25c>   DW_AT_name        : (indirect string, offset: 0x10d): _IO_marker
    <260>   DW_AT_declaration : 1
 <1><260>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <261>   DW_AT_byte_size   : 8
    <261>   DW_AT_type        : <0x25b>
 <1><265>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <266>   DW_AT_byte_size   : 8
    <266>   DW_AT_type        : <0xc1>
 <1><26a>: Abbrev Number: 13 (DW_TAG_array_type)
    <26b>   DW_AT_type        : <0xb5>
    <26f>   DW_AT_sibling     : <0x27a>
 <2><273>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <274>   DW_AT_type        : <0x41>
    <278>   DW_AT_upper_bound : 0
 <2><279>: Abbrev Number: 0
 <1><27a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <27b>   DW_AT_byte_size   : 8
    <27b>   DW_AT_type        : <0x253>
 <1><27f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <280>   DW_AT_name        : (indirect string, offset: 0xe6): _IO_codecvt
    <284>   DW_AT_declaration : 1
 <1><284>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <285>   DW_AT_byte_size   : 8
    <285>   DW_AT_type        : <0x27f>
 <1><289>: Abbrev Number: 16 (DW_TAG_structure_type)
    <28a>   DW_AT_name        : (indirect string, offset: 0x24b): _IO_wide_data
    <28e>   DW_AT_declaration : 1
 <1><28e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <28f>   DW_AT_byte_size   : 8
    <28f>   DW_AT_type        : <0x289>
 <1><293>: Abbrev Number: 13 (DW_TAG_array_type)
    <294>   DW_AT_type        : <0xb5>
    <298>   DW_AT_sibling     : <0x2a3>
 <2><29c>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <29d>   DW_AT_type        : <0x41>
    <2a1>   DW_AT_upper_bound : 19
 <2><2a2>: Abbrev Number: 0
 <1><2a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2a4>   DW_AT_byte_size   : 8
    <2a4>   DW_AT_type        : <0x247>
 <1><2a8>: Abbrev Number: 22 (DW_TAG_restrict_type)
    <2a9>   DW_AT_type        : <0x2a3>
 <1><2ad>: Abbrev Number: 4 (DW_TAG_base_type)
    <2ae>   DW_AT_byte_size   : 8
    <2af>   DW_AT_encoding    : 5	(signed)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x71): long long int
 <1><2b4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x263): timespec
    <2b9>   DW_AT_byte_size   : 16
    <2ba>   DW_AT_decl_file   : 6
    <2bb>   DW_AT_decl_line   : 11
    <2bc>   DW_AT_decl_column : 8
    <2bc>   DW_AT_sibling     : <0x2db>
 <2><2c0>: Abbrev Number: 2 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x195): tv_sec
    <2c5>   DW_AT_decl_file   : 6
    <2c6>   DW_AT_decl_line   : 16
    <2c7>   DW_AT_decl_column : 12
    <2c8>   DW_AT_type        : <0x98>
    <2cc>   DW_AT_data_member_location: 0
 <2><2cd>: Abbrev Number: 2 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x18d): tv_nsec
    <2d2>   DW_AT_decl_file   : 6
    <2d3>   DW_AT_decl_line   : 21
    <2d4>   DW_AT_decl_column : 21
    <2d5>   DW_AT_type        : <0xa4>
    <2d9>   DW_AT_data_member_location: 8
 <2><2da>: Abbrev Number: 0
 <1><2db>: Abbrev Number: 12 (DW_TAG_const_type)
    <2dc>   DW_AT_type        : <0x2b4>
 <1><2e0>: Abbrev Number: 4 (DW_TAG_base_type)
    <2e1>   DW_AT_byte_size   : 8
    <2e2>   DW_AT_encoding    : 7	(unsigned)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x50): long long unsigned int
 <1><2e7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2e8>   DW_AT_byte_size   : 8
    <2e8>   DW_AT_type        : <0xbc>
 <1><2ec>: Abbrev Number: 22 (DW_TAG_restrict_type)
    <2ed>   DW_AT_type        : <0x2e7>
 <1><2f1>: Abbrev Number: 30 (DW_TAG_variable)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x90): blinky
    <2f6>   DW_AT_decl_file   : 1
    <2f7>   DW_AT_decl_line   : 12
    <2f8>   DW_AT_decl_column : 18
    <2f9>   DW_AT_type        : <0x7b>
    <2fd>   DW_AT_const_value : 440
 <1><2ff>: Abbrev Number: 23 (DW_TAG_variable)
    <300>   DW_AT_name        : fp
    <303>   DW_AT_decl_file   : 1
    <303>   DW_AT_decl_line   : 17
    <304>   DW_AT_decl_column : 14
    <305>   DW_AT_type        : <0x2a3>
    <309>   DW_AT_location    : 9 byte block: 3 0 0 0 0 0 0 30 80 	(DW_OP_addr: 3080)
 <1><313>: Abbrev Number: 9 (DW_TAG_variable)
    <314>   DW_AT_name        : (indirect string, offset: 0x219): time_dit
    <318>   DW_AT_decl_file   : 1
    <318>   DW_AT_decl_line   : 85
    <319>   DW_AT_decl_column : 21
    <319>   DW_AT_type        : <0x326>
    <31d>   DW_AT_const_value : 8 byte block: 3f d5 1e b8 51 eb 85 1f 
 <1><326>: Abbrev Number: 12 (DW_TAG_const_type)
    <327>   DW_AT_type        : <0x2e>
 <1><32b>: Abbrev Number: 9 (DW_TAG_variable)
    <32c>   DW_AT_name        : (indirect string, offset: 0x1bc): time_dah
    <330>   DW_AT_decl_file   : 1
    <330>   DW_AT_decl_line   : 86
    <331>   DW_AT_decl_column : 21
    <331>   DW_AT_type        : <0x326>
    <335>   DW_AT_const_value : 8 byte block: 3f ef ae 14 7a e1 47 ae 
 <1><33e>: Abbrev Number: 9 (DW_TAG_variable)
    <33f>   DW_AT_name        : (indirect string, offset: 0x222): time_space
    <343>   DW_AT_decl_file   : 1
    <343>   DW_AT_decl_line   : 88
    <344>   DW_AT_decl_column : 21
    <344>   DW_AT_type        : <0x326>
    <348>   DW_AT_const_value : 8 byte block: 3f d5 1e b8 51 eb 85 1f 
 <1><351>: Abbrev Number: 9 (DW_TAG_variable)
    <352>   DW_AT_name        : (indirect string, offset: 0x1e2): time_letter
    <356>   DW_AT_decl_file   : 1
    <356>   DW_AT_decl_line   : 90
    <357>   DW_AT_decl_column : 21
    <357>   DW_AT_type        : <0x326>
    <35b>   DW_AT_const_value : 8 byte block: 3f e5 1e b8 51 eb 85 1f 
 <1><364>: Abbrev Number: 9 (DW_TAG_variable)
    <365>   DW_AT_name        : (indirect string, offset: 0x1c): time_word
    <369>   DW_AT_decl_file   : 1
    <369>   DW_AT_decl_line   : 92
    <36a>   DW_AT_decl_column : 21
    <36a>   DW_AT_type        : <0x326>
    <36e>   DW_AT_const_value : 8 byte block: 3f f5 1e b8 51 eb 85 1f 
 <1><377>: Abbrev Number: 13 (DW_TAG_array_type)
    <378>   DW_AT_type        : <0x2e7>
    <37c>   DW_AT_sibling     : <0x387>
 <2><380>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <381>   DW_AT_type        : <0x41>
    <385>   DW_AT_upper_bound : 35
 <2><386>: Abbrev Number: 0
 <1><387>: Abbrev Number: 24 (DW_TAG_variable)
    <388>   DW_AT_name        : (indirect string, offset: 0x259): morse_tbl
    <38c>   DW_AT_decl_file   : 1
    <38c>   DW_AT_decl_line   : 100
    <38d>   DW_AT_decl_column : 20
    <38e>   DW_AT_type        : <0x377>
    <392>   DW_AT_location    : 9 byte block: 3 0 0 0 0 0 0 2c c0 	(DW_OP_addr: 2cc0)
 <1><39c>: Abbrev Number: 10 (DW_TAG_subprogram)
    <39d>   DW_AT_external    : 1
    <39d>   DW_AT_name        : (indirect string, offset: 0x67): nanosleep
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 281
    <3a4>   DW_AT_decl_column : 12
    <3a5>   DW_AT_prototyped  : 1
    <3a5>   DW_AT_type        : <0x74>
    <3a9>   DW_AT_declaration : 1
