
a.out:     file format elf32-m68k

SYMBOL TABLE:
80000134 l    d  .interp	00000000              .interp
80000144 l    d  .note.gnu.build-id	00000000              .note.gnu.build-id
80000168 l    d  .note.ABI-tag	00000000              .note.ABI-tag
80000188 l    d  .hash	00000000              .hash
800001dc l    d  .gnu.hash	00000000              .gnu.hash
80000240 l    d  .dynsym	00000000              .dynsym
80000340 l    d  .dynstr	00000000              .dynstr
800003e0 l    d  .gnu.version	00000000              .gnu.version
80000400 l    d  .gnu.version_r	00000000              .gnu.version_r
80000440 l    d  .rela.dyn	00000000              .rela.dyn
80000458 l    d  .rela.plt	00000000              .rela.plt
800004f4 l    d  .init	00000000              .init
8000051c l    d  .plt	00000000              .plt
80000634 l    d  .text	00000000              .text
80000a08 l    d  .fini	00000000              .fini
80000a1e l    d  .rodata	00000000              .rodata
80000c72 l    d  .eh_frame	00000000              .eh_frame
80003f08 l    d  .init_array	00000000              .init_array
80003f0c l    d  .fini_array	00000000              .fini_array
80003f10 l    d  .dynamic	00000000              .dynamic
80004000 l    d  .got	00000000              .got
80004048 l    d  .data	00000000              .data
80004050 l    d  .bss	00000000              .bss
00000000 l    d  .comment	00000000              .comment
00000000 l    d  .debug_aranges	00000000              .debug_aranges

80000a08:	4e56 0000      	linkw %fp,#0
80000a0c:	2f0d           	movel %a5,%sp@-
80000a0e:	4bfb 0170 0000 	lea %pc@(80004000 <_GLOBAL_OFFSET_TABLE_>),%a5
80000a14:	35f0 
80000a16:	2a6e fffc      	moveal %fp@(-4),%a5
80000a1a:	4e5e           	unlk %fp
80000a1c:	4e75           	rts
Contents of the .eh_frame section (loaded from a.out):


00000000 ZERO terminator


Contents of the .debug_aranges section (loaded from a.out):

  Length:                   28
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    800006d0 00000336
    00000000 00000000

Contents of the .debug_info section (loaded from a.out):

  Compilation Unit @ offset 0:
   Length:        0x714 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2b6): GNU C99 12.2.0 -mcpu=68020 -g -O1 -std=gnu99
    <11>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0xe5): ../morse.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x31f): /root/hello-world/m68k-linux-gnu
    <1a>   DW_AT_low_pc      : 0x800006d0
    <1e>   DW_AT_high_pc     : 0x336
    <22>   DW_AT_stmt_list   : 0
 <1><26>: Abbrev Number: 6 (DW_TAG_typedef)
    <27>   DW_AT_name        : (indirect string, offset: 0x26): size_t
    <2b>   DW_AT_decl_file   : 2
    <2c>   DW_AT_decl_line   : 214
    <2d>   DW_AT_decl_column : 23
    <2e>   DW_AT_type        : <0x32>
 <1><32>: Abbrev Number: 3 (DW_TAG_base_type)
    <33>   DW_AT_byte_size   : 4
    <34>   DW_AT_encoding    : 7	(unsigned)
    <35>   DW_AT_name        : (indirect string, offset: 0x5a): unsigned int
 <1><39>: Abbrev Number: 3 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 1
    <3b>   DW_AT_encoding    : 8	(unsigned char)
    <3c>   DW_AT_name        : (indirect string, offset: 0x23d): unsigned char
 <1><40>: Abbrev Number: 3 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 2
    <42>   DW_AT_encoding    : 7	(unsigned)
    <43>   DW_AT_name        : (indirect string, offset: 0x145): short unsigned int
 <1><47>: Abbrev Number: 3 (DW_TAG_base_type)
    <48>   DW_AT_byte_size   : 4
    <49>   DW_AT_encoding    : 7	(unsigned)
    <4a>   DW_AT_name        : (indirect string, offset: 0x55): long unsigned int
 <1><4e>: Abbrev Number: 3 (DW_TAG_base_type)
    <4f>   DW_AT_byte_size   : 1
    <50>   DW_AT_encoding    : 6	(signed char)
    <51>   DW_AT_name        : (indirect string, offset: 0x23f): signed char
 <1><55>: Abbrev Number: 3 (DW_TAG_base_type)
    <56>   DW_AT_byte_size   : 2
    <57>   DW_AT_encoding    : 5	(signed)
    <58>   DW_AT_name        : (indirect string, offset: 0x24b): short int
 <1><5c>: Abbrev Number: 24 (DW_TAG_base_type)
    <5d>   DW_AT_byte_size   : 4
    <5e>   DW_AT_encoding    : 5	(signed)
    <5f>   DW_AT_name        : int
 <1><63>: Abbrev Number: 10 (DW_TAG_const_type)
    <64>   DW_AT_type        : <0x5c>
 <1><68>: Abbrev Number: 6 (DW_TAG_typedef)
    <69>   DW_AT_name        : (indirect string, offset: 0x71): __int64_t
    <6d>   DW_AT_decl_file   : 3
    <6e>   DW_AT_decl_line   : 47
    <6f>   DW_AT_decl_column : 44
    <70>   DW_AT_type        : <0x74>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 8
    <76>   DW_AT_encoding    : 5	(signed)
    <77>   DW_AT_name        : (indirect string, offset: 0x7b): long long int
 <1><7b>: Abbrev Number: 3 (DW_TAG_base_type)
    <7c>   DW_AT_byte_size   : 8
    <7d>   DW_AT_encoding    : 7	(unsigned)
    <7e>   DW_AT_name        : (indirect string, offset: 0x50): long long unsigned int
 <1><82>: Abbrev Number: 6 (DW_TAG_typedef)
    <83>   DW_AT_name        : (indirect string, offset: 0): __off_t
    <87>   DW_AT_decl_file   : 3
    <88>   DW_AT_decl_line   : 152
    <89>   DW_AT_decl_column : 25
    <8a>   DW_AT_type        : <0x8e>
 <1><8e>: Abbrev Number: 3 (DW_TAG_base_type)
    <8f>   DW_AT_byte_size   : 4
    <90>   DW_AT_encoding    : 5	(signed)
    <91>   DW_AT_name        : (indirect string, offset: 0x80): long int
 <1><95>: Abbrev Number: 6 (DW_TAG_typedef)
    <96>   DW_AT_name        : (indirect string, offset: 0x291): __off64_t
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 153
    <9c>   DW_AT_decl_column : 27
    <9d>   DW_AT_type        : <0x68>
 <1><a1>: Abbrev Number: 6 (DW_TAG_typedef)
    <a2>   DW_AT_name        : (indirect string, offset: 0x2ea): __time_t
    <a6>   DW_AT_decl_file   : 3
    <a7>   DW_AT_decl_line   : 160
    <a8>   DW_AT_decl_column : 26
    <a9>   DW_AT_type        : <0x8e>
 <1><ad>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <ae>   DW_AT_byte_size   : 4
 <1><af>: Abbrev Number: 6 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0x1a6): __syscall_slong_t
    <b4>   DW_AT_decl_file   : 3
    <b5>   DW_AT_decl_line   : 197
    <b6>   DW_AT_decl_column : 33
    <b7>   DW_AT_type        : <0x8e>
 <1><bb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <bc>   DW_AT_byte_size   : 4
    <bc>   DW_AT_type        : <0xc0>
 <1><c0>: Abbrev Number: 3 (DW_TAG_base_type)
    <c1>   DW_AT_byte_size   : 1
    <c2>   DW_AT_encoding    : 6	(signed char)
    <c3>   DW_AT_name        : (indirect string, offset: 0x246): char
 <1><c7>: Abbrev Number: 10 (DW_TAG_const_type)
    <c8>   DW_AT_type        : <0xc0>
 <1><cc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cd>   DW_AT_name        : (indirect string, offset: 0x1e3): _IO_FILE
    <d1>   DW_AT_byte_size   : 148
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 49
    <d4>   DW_AT_decl_column : 8
    <d4>   DW_AT_sibling     : <0x252>
 <2><d8>: Abbrev Number: 2 (DW_TAG_member)
    <d9>   DW_AT_name        : (indirect string, offset: 0xc6): _flags
    <dd>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 51
    <df>   DW_AT_decl_column : 7
    <e0>   DW_AT_type        : <0x5c>
    <e4>   DW_AT_data_member_location: 0
 <2><e5>: Abbrev Number: 2 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x8): _IO_read_ptr
    <ea>   DW_AT_decl_file   : 4
    <eb>   DW_AT_decl_line   : 54
    <ec>   DW_AT_decl_column : 9
    <ed>   DW_AT_type        : <0xbb>
    <f1>   DW_AT_data_member_location: 4
 <2><f2>: Abbrev Number: 2 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0xb9): _IO_read_end
    <f7>   DW_AT_decl_file   : 4
    <f8>   DW_AT_decl_line   : 55
    <f9>   DW_AT_decl_column : 9
    <fa>   DW_AT_type        : <0xbb>
    <fe>   DW_AT_data_member_location: 8
 <2><ff>: Abbrev Number: 2 (DW_TAG_member)
    <100>   DW_AT_name        : (indirect string, offset: 0x29b): _IO_read_base
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 56
    <106>   DW_AT_decl_column : 9
    <107>   DW_AT_type        : <0xbb>
    <10b>   DW_AT_data_member_location: 12
 <2><10c>: Abbrev Number: 2 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x358): _IO_write_base
    <111>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 57
    <113>   DW_AT_decl_column : 9
    <114>   DW_AT_type        : <0xbb>
    <118>   DW_AT_data_member_location: 16
 <2><119>: Abbrev Number: 2 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x137): _IO_write_ptr
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 58
    <120>   DW_AT_decl_column : 9
    <121>   DW_AT_type        : <0xbb>
    <125>   DW_AT_data_member_location: 20
 <2><126>: Abbrev Number: 2 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0x1b8): _IO_write_end
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 59
    <12d>   DW_AT_decl_column : 9
    <12e>   DW_AT_type        : <0xbb>
    <132>   DW_AT_data_member_location: 24
 <2><133>: Abbrev Number: 2 (DW_TAG_member)
    <134>   DW_AT_name        : (indirect string, offset: 0x43): _IO_buf_base
    <138>   DW_AT_decl_file   : 4
    <139>   DW_AT_decl_line   : 60
    <13a>   DW_AT_decl_column : 9
    <13b>   DW_AT_type        : <0xbb>
    <13f>   DW_AT_data_member_location: 28
 <2><140>: Abbrev Number: 2 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0xcd): _IO_buf_end
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 61
    <147>   DW_AT_decl_column : 9
    <148>   DW_AT_type        : <0xbb>
    <14c>   DW_AT_data_member_location: 32
 <2><14d>: Abbrev Number: 2 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x158): _IO_save_base
    <152>   DW_AT_decl_file   : 4
    <153>   DW_AT_decl_line   : 64
    <154>   DW_AT_decl_column : 9
    <155>   DW_AT_type        : <0xbb>
    <159>   DW_AT_data_member_location: 36
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : (indirect string, offset: 0x30f): _IO_backup_base
    <15f>   DW_AT_decl_file   : 4
    <160>   DW_AT_decl_line   : 65
    <161>   DW_AT_decl_column : 9
    <162>   DW_AT_type        : <0xbb>
    <166>   DW_AT_data_member_location: 40
 <2><167>: Abbrev Number: 2 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x2a9): _IO_save_end
    <16c>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 66
    <16e>   DW_AT_decl_column : 9
    <16f>   DW_AT_type        : <0xbb>
    <173>   DW_AT_data_member_location: 44
 <2><174>: Abbrev Number: 2 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0x20d): _markers
    <179>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 68
    <17b>   DW_AT_decl_column : 22
    <17c>   DW_AT_type        : <0x26b>
    <180>   DW_AT_data_member_location: 48
 <2><181>: Abbrev Number: 2 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x15): _chain
    <186>   DW_AT_decl_file   : 4
    <187>   DW_AT_decl_line   : 70
    <188>   DW_AT_decl_column : 20
    <189>   DW_AT_type        : <0x270>
    <18d>   DW_AT_data_member_location: 52
 <2><18e>: Abbrev Number: 2 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0xa1): _fileno
    <193>   DW_AT_decl_file   : 4
    <194>   DW_AT_decl_line   : 72
    <195>   DW_AT_decl_column : 7
    <196>   DW_AT_type        : <0x5c>
    <19a>   DW_AT_data_member_location: 56
 <2><19b>: Abbrev Number: 2 (DW_TAG_member)
    <19c>   DW_AT_name        : (indirect string, offset: 0x174): _flags2
    <1a0>   DW_AT_decl_file   : 4
    <1a1>   DW_AT_decl_line   : 73
    <1a2>   DW_AT_decl_column : 7
    <1a3>   DW_AT_type        : <0x5c>
    <1a7>   DW_AT_data_member_location: 60
 <2><1a8>: Abbrev Number: 2 (DW_TAG_member)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x103): _old_offset
    <1ad>   DW_AT_decl_file   : 4
    <1ae>   DW_AT_decl_line   : 74
    <1af>   DW_AT_decl_column : 11
    <1b0>   DW_AT_type        : <0x82>
    <1b4>   DW_AT_data_member_location: 64
 <2><1b5>: Abbrev Number: 2 (DW_TAG_member)
    <1b6>   DW_AT_name        : (indirect string, offset: 0xd9): _cur_column
    <1ba>   DW_AT_decl_file   : 4
    <1bb>   DW_AT_decl_line   : 77
    <1bc>   DW_AT_decl_column : 18
    <1bd>   DW_AT_type        : <0x40>
    <1c1>   DW_AT_data_member_location: 68
 <2><1c2>: Abbrev Number: 2 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x276): _vtable_offset
    <1c7>   DW_AT_decl_file   : 4
    <1c8>   DW_AT_decl_line   : 78
    <1c9>   DW_AT_decl_column : 15
    <1ca>   DW_AT_type        : <0x4e>
    <1ce>   DW_AT_data_member_location: 70
 <2><1cf>: Abbrev Number: 2 (DW_TAG_member)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x2d): _shortbuf
    <1d4>   DW_AT_decl_file   : 4
    <1d5>   DW_AT_decl_line   : 79
    <1d6>   DW_AT_decl_column : 8
    <1d7>   DW_AT_type        : <0x275>
    <1db>   DW_AT_data_member_location: 71
 <2><1dc>: Abbrev Number: 2 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x166): _lock
    <1e1>   DW_AT_decl_file   : 4
    <1e2>   DW_AT_decl_line   : 81
    <1e3>   DW_AT_decl_column : 15
    <1e4>   DW_AT_type        : <0x285>
    <1e8>   DW_AT_data_member_location: 72
 <2><1e9>: Abbrev Number: 2 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x107): _offset
    <1ee>   DW_AT_decl_file   : 4
    <1ef>   DW_AT_decl_line   : 89
    <1f0>   DW_AT_decl_column : 13
    <1f1>   DW_AT_type        : <0x95>
    <1f5>   DW_AT_data_member_location: 76
 <2><1f6>: Abbrev Number: 2 (DW_TAG_member)
    <1f7>   DW_AT_name        : (indirect string, offset: 0xf3): _codecvt
    <1fb>   DW_AT_decl_file   : 4
    <1fc>   DW_AT_decl_line   : 91
    <1fd>   DW_AT_decl_column : 23
    <1fe>   DW_AT_type        : <0x28f>
    <202>   DW_AT_data_member_location: 84
 <2><203>: Abbrev Number: 2 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x258): _wide_data
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 92
    <20a>   DW_AT_decl_column : 25
    <20b>   DW_AT_type        : <0x299>
    <20f>   DW_AT_data_member_location: 88
 <2><210>: Abbrev Number: 2 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x345): _freeres_list
    <215>   DW_AT_decl_file   : 4
    <216>   DW_AT_decl_line   : 93
    <217>   DW_AT_decl_column : 20
    <218>   DW_AT_type        : <0x270>
    <21c>   DW_AT_data_member_location: 92
 <2><21d>: Abbrev Number: 2 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x122): _freeres_buf
    <222>   DW_AT_decl_file   : 4
    <223>   DW_AT_decl_line   : 94
    <224>   DW_AT_decl_column : 9
    <225>   DW_AT_type        : <0xad>
    <229>   DW_AT_data_member_location: 96
 <2><22a>: Abbrev Number: 2 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x2e3): __pad5
    <22f>   DW_AT_decl_file   : 4
    <230>   DW_AT_decl_line   : 95
    <231>   DW_AT_decl_column : 10
    <232>   DW_AT_type        : <0x26>
    <236>   DW_AT_data_member_location: 100
 <2><237>: Abbrev Number: 2 (DW_TAG_member)
    <238>   DW_AT_name        : (indirect string, offset: 0x17c): _mode
    <23c>   DW_AT_decl_file   : 4
    <23d>   DW_AT_decl_line   : 96
    <23e>   DW_AT_decl_column : 7
    <23f>   DW_AT_type        : <0x5c>
    <243>   DW_AT_data_member_location: 104
 <2><244>: Abbrev Number: 2 (DW_TAG_member)
    <245>   DW_AT_name        : (indirect string, offset: 0x2f3): _unused2
    <249>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 98
    <24b>   DW_AT_decl_column : 8
    <24c>   DW_AT_type        : <0x29e>
    <250>   DW_AT_data_member_location: 108
 <2><251>: Abbrev Number: 0
 <1><252>: Abbrev Number: 6 (DW_TAG_typedef)
    <253>   DW_AT_name        : (indirect string, offset: 0x1e7): FILE
    <257>   DW_AT_decl_file   : 5
    <258>   DW_AT_decl_line   : 7
    <259>   DW_AT_decl_column : 25
    <25a>   DW_AT_type        : <0xcc>
 <1><25e>: Abbrev Number: 26 (DW_TAG_typedef)
    <25f>   DW_AT_name        : (indirect string, offset: 0x1cf): _IO_lock_t
    <263>   DW_AT_decl_file   : 4
    <264>   DW_AT_decl_line   : 43
    <265>   DW_AT_decl_column : 14
 <1><266>: Abbrev Number: 13 (DW_TAG_structure_type)
    <267>   DW_AT_name        : (indirect string, offset: 0x117): _IO_marker
    <26b>   DW_AT_declaration : 1
 <1><26b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <26c>   DW_AT_byte_size   : 4
    <26c>   DW_AT_type        : <0x266>
 <1><270>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <271>   DW_AT_byte_size   : 4
    <271>   DW_AT_type        : <0xcc>
 <1><275>: Abbrev Number: 11 (DW_TAG_array_type)
    <276>   DW_AT_type        : <0xc0>
    <27a>   DW_AT_sibling     : <0x285>
 <2><27e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <27f>   DW_AT_type        : <0x32>
    <283>   DW_AT_upper_bound : 0
 <2><284>: Abbrev Number: 0
 <1><285>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <286>   DW_AT_byte_size   : 4
    <286>   DW_AT_type        : <0x25e>
 <1><28a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <28b>   DW_AT_name        : (indirect string, offset: 0xf0): _IO_codecvt
    <28f>   DW_AT_declaration : 1
 <1><28f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <290>   DW_AT_byte_size   : 4
    <290>   DW_AT_type        : <0x28a>
 <1><294>: Abbrev Number: 13 (DW_TAG_structure_type)
    <295>   DW_AT_name        : (indirect string, offset: 0x255): _IO_wide_data
    <299>   DW_AT_declaration : 1
 <1><299>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <29a>   DW_AT_byte_size   : 4
    <29a>   DW_AT_type        : <0x294>
 <1><29e>: Abbrev Number: 11 (DW_TAG_array_type)
    <29f>   DW_AT_type        : <0xc0>
    <2a3>   DW_AT_sibling     : <0x2ae>
 <2><2a7>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <2a8>   DW_AT_type        : <0x32>
    <2ac>   DW_AT_upper_bound : 39
 <2><2ad>: Abbrev Number: 0
 <1><2ae>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <2af>   DW_AT_byte_size   : 4
    <2af>   DW_AT_type        : <0x252>
 <1><2b3>: Abbrev Number: 18 (DW_TAG_restrict_type)
    <2b4>   DW_AT_type        : <0x2ae>
 <1><2b8>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x26d): timespec
    <2bd>   DW_AT_byte_size   : 8
    <2be>   DW_AT_decl_file   : 6
    <2bf>   DW_AT_decl_line   : 11
    <2c0>   DW_AT_decl_column : 8
    <2c0>   DW_AT_sibling     : <0x2df>
 <2><2c4>: Abbrev Number: 2 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x19f): tv_sec
    <2c9>   DW_AT_decl_file   : 6
    <2ca>   DW_AT_decl_line   : 16
    <2cb>   DW_AT_decl_column : 12
    <2cc>   DW_AT_type        : <0xa1>
    <2d0>   DW_AT_data_member_location: 0
 <2><2d1>: Abbrev Number: 2 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x197): tv_nsec
    <2d6>   DW_AT_decl_file   : 6
    <2d7>   DW_AT_decl_line   : 21
    <2d8>   DW_AT_decl_column : 21
    <2d9>   DW_AT_type        : <0xaf>
    <2dd>   DW_AT_data_member_location: 4
 <2><2de>: Abbrev Number: 0
 <1><2df>: Abbrev Number: 10 (DW_TAG_const_type)
    <2e0>   DW_AT_type        : <0x2b8>
 <1><2e4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <2e5>   DW_AT_byte_size   : 4
    <2e5>   DW_AT_type        : <0xc7>
 <1><2e9>: Abbrev Number: 18 (DW_TAG_restrict_type)
    <2ea>   DW_AT_type        : <0x2e4>
 <1><2ee>: Abbrev Number: 27 (DW_TAG_variable)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x9a): blinky
    <2f3>   DW_AT_decl_file   : 1
    <2f4>   DW_AT_decl_line   : 12
    <2f5>   DW_AT_decl_column : 18
    <2f6>   DW_AT_type        : <0x63>
    <2fa>   DW_AT_const_value : 440
 <1><2fc>: Abbrev Number: 19 (DW_TAG_variable)
    <2fd>   DW_AT_name        : fp
    <300>   DW_AT_decl_file   : 1
    <300>   DW_AT_decl_line   : 17
    <301>   DW_AT_decl_column : 14
    <302>   DW_AT_type        : <0x2ae>
    <306>   DW_AT_location    : 5 byte block: 3 80 0 40 54 	(DW_OP_addr: 80004054)
 <1><30c>: Abbrev Number: 7 (DW_TAG_variable)
    <30d>   DW_AT_name        : (indirect string, offset: 0x223): time_dit
    <311>   DW_AT_decl_file   : 1
    <311>   DW_AT_decl_line   : 85
    <312>   DW_AT_decl_column : 21
    <312>   DW_AT_type        : <0x326>
    <316>   DW_AT_const_value : 8 byte block: 3f d5 1e b8 51 eb 85 1f 
 <1><31f>: Abbrev Number: 3 (DW_TAG_base_type)
    <320>   DW_AT_byte_size   : 8
    <321>   DW_AT_encoding    : 4	(float)
    <322>   DW_AT_name        : (indirect string, offset: 0xfc): double
 <1><326>: Abbrev Number: 10 (DW_TAG_const_type)
    <327>   DW_AT_type        : <0x31f>
 <1><32b>: Abbrev Number: 7 (DW_TAG_variable)
    <32c>   DW_AT_name        : (indirect string, offset: 0x1c6): time_dah
    <330>   DW_AT_decl_file   : 1
    <330>   DW_AT_decl_line   : 86
    <331>   DW_AT_decl_column : 21
    <331>   DW_AT_type        : <0x326>
    <335>   DW_AT_const_value : 8 byte block: 3f ef ae 14 7a e1 47 ae 
 <1><33e>: Abbrev Number: 7 (DW_TAG_variable)
    <33f>   DW_AT_name        : (indirect string, offset: 0x22c): time_space
    <343>   DW_AT_decl_file   : 1
    <343>   DW_AT_decl_line   : 88
    <344>   DW_AT_decl_column : 21
    <344>   DW_AT_type        : <0x326>
    <348>   DW_AT_const_value : 8 byte block: 3f d5 1e b8 51 eb 85 1f 
 <1><351>: Abbrev Number: 7 (DW_TAG_variable)
    <352>   DW_AT_name        : (indirect string, offset: 0x1ec): time_letter
    <356>   DW_AT_decl_file   : 1
    <356>   DW_AT_decl_line   : 90
    <357>   DW_AT_decl_column : 21
    <357>   DW_AT_type        : <0x326>
    <35b>   DW_AT_const_value : 8 byte block: 3f e5 1e b8 51 eb 85 1f 
 <1><364>: Abbrev Number: 7 (DW_TAG_variable)
    <365>   DW_AT_name        : (indirect string, offset: 0x1c): time_word
    <369>   DW_AT_decl_file   : 1
    <369>   DW_AT_decl_line   : 92
    <36a>   DW_AT_decl_column : 21
    <36a>   DW_AT_type        : <0x326>
    <36e>   DW_AT_const_value : 8 byte block: 3f f5 1e b8 51 eb 85 1f 
 <1><377>: Abbrev Number: 11 (DW_TAG_array_type)
    <378>   DW_AT_type        : <0x2e4>
    <37c>   DW_AT_sibling     : <0x387>
 <2><380>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <381>   DW_AT_type        : <0x32>
    <385>   DW_AT_upper_bound : 35
 <2><386>: Abbrev Number: 0
 <1><387>: Abbrev Number: 20 (DW_TAG_variable)
    <388>   DW_AT_name        : (indirect string, offset: 0x263): morse_tbl
    <38c>   DW_AT_decl_file   : 1
    <38c>   DW_AT_decl_line   : 100
    <38d>   DW_AT_decl_column : 20
    <38e>   DW_AT_type        : <0x377>
    <392>   DW_AT_location    : 5 byte block: 3 80 0 b e2 	(DW_OP_addr: 80000be2)
 <1><398>: Abbrev Number: 8 (DW_TAG_subprogram)
    <399>   DW_AT_external    : 1
    <399>   DW_AT_name        : (indirect string, offset: 0x67): nanosleep
    <39d>   DW_AT_decl_file   : 7
    <39e>   DW_AT_decl_line   : 281
    <3a0>   DW_AT_decl_column : 12
    <3a1>   DW_AT_prototyped  : 1
    <3a1>   DW_AT_type        : <0x5c>
    <3a5>   DW_AT_declaration : 1
    <3a5>   DW_AT_sibling     : <0x3b4>
