
a.out:     file format elf32-littlearc

SYMBOL TABLE:
00010154 l    d  .interp	00000000              .interp
0001016c l    d  .note.gnu.build-id	00000000              .note.gnu.build-id
00010190 l    d  .note.ABI-tag	00000000              .note.ABI-tag
000101b0 l    d  .hash	00000000              .hash
000101f8 l    d  .gnu.hash	00000000              .gnu.hash
00010254 l    d  .dynsym	00000000              .dynsym
00010324 l    d  .dynstr	00000000              .dynstr
0001039c l    d  .gnu.version	00000000              .gnu.version
000103b8 l    d  .gnu.version_r	00000000              .gnu.version_r
000103e8 l    d  .rela.plt	00000000              .rela.plt
00010478 l    d  .init	00000000              .init
00010484 l    d  .plt	00000000              .plt
00010564 l    d  .text	00000000              .text
000108b4 l    d  .fini	00000000              .fini
000108c0 l    d  .rodata	00000000              .rodata
00010bb0 l    d  .eh_frame_hdr	00000000              .eh_frame_hdr
00010bc4 l    d  .eh_frame	00000000              .eh_frame
00013f0c l    d  .init_array	00000000              .init_array
00013f10 l    d  .fini_array	00000000              .fini_array
00013f14 l    d  .dynamic	00000000              .dynamic
00013ffc l    d  .got.plt	00000000              .got.plt
00014038 l    d  .data	00000000              .data
00014040 l    d  .bss	00000000              .bss
00000000 l    d  .comment	00000000              .comment

   108bc:	7ee0                	j_s	[blink]
Contents of the .eh_frame section (loaded from a.out):


00000000 00000010 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -4
  Return address column: 31
  Augmentation data:     1b
  DW_CFA_def_cfa: r28 ofs 0

00000014 00000010 00000018 FDE cie=00000000 pc=00010564..0001058a
  DW_CFA_undefined: r31
  DW_CFA_nop

00000028 ZERO terminator


Contents of the .debug_aranges section (loaded from a.out):

  Length:                   28
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    000105fc 000002b8
    00000000 00000000

Contents of the .debug_info section (loaded from a.out):

  Compilation Unit @ offset 0:
   Length:        0x927 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x91): GNU C99 12.2.0 -g -O1 -std=gnu99
    <11>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0x126): ../morse.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x71): /root/hello-world/arc-linux-gnu
    <1a>   DW_AT_low_pc      : 0x105fc
    <1e>   DW_AT_high_pc     : 0x2b8
    <22>   DW_AT_stmt_list   : 0
 <1><26>: Abbrev Number: 4 (DW_TAG_base_type)
    <27>   DW_AT_byte_size   : 8
    <28>   DW_AT_encoding    : 4	(float)
    <29>   DW_AT_name        : (indirect string, offset: 0x13d): double
 <1><2d>: Abbrev Number: 8 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x26): size_t
    <32>   DW_AT_decl_file   : 2
    <33>   DW_AT_decl_line   : 214
    <34>   DW_AT_decl_column : 23
    <35>   DW_AT_type        : <0x39>
 <1><39>: Abbrev Number: 4 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 4
    <3b>   DW_AT_encoding    : 7	(unsigned)
    <3c>   DW_AT_name        : (indirect string, offset: 0x5a): unsigned int
 <1><40>: Abbrev Number: 4 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 1
    <42>   DW_AT_encoding    : 8	(unsigned char)
    <43>   DW_AT_name        : (indirect string, offset: 0x26c): unsigned char
 <1><47>: Abbrev Number: 4 (DW_TAG_base_type)
    <48>   DW_AT_byte_size   : 2
    <49>   DW_AT_encoding    : 7	(unsigned)
    <4a>   DW_AT_name        : (indirect string, offset: 0x186): short unsigned int
 <1><4e>: Abbrev Number: 4 (DW_TAG_base_type)
    <4f>   DW_AT_byte_size   : 4
    <50>   DW_AT_encoding    : 7	(unsigned)
    <51>   DW_AT_name        : (indirect string, offset: 0x55): long unsigned int
 <1><55>: Abbrev Number: 4 (DW_TAG_base_type)
    <56>   DW_AT_byte_size   : 1
    <57>   DW_AT_encoding    : 6	(signed char)
    <58>   DW_AT_name        : (indirect string, offset: 0x26e): signed char
 <1><5c>: Abbrev Number: 4 (DW_TAG_base_type)
    <5d>   DW_AT_byte_size   : 2
    <5e>   DW_AT_encoding    : 5	(signed)
    <5f>   DW_AT_name        : (indirect string, offset: 0x27a): short int
 <1><63>: Abbrev Number: 27 (DW_TAG_base_type)
    <64>   DW_AT_byte_size   : 4
    <65>   DW_AT_encoding    : 5	(signed)
    <66>   DW_AT_name        : int
 <1><6a>: Abbrev Number: 12 (DW_TAG_const_type)
    <6b>   DW_AT_type        : <0x63>
 <1><6f>: Abbrev Number: 8 (DW_TAG_typedef)
    <70>   DW_AT_name        : (indirect string, offset: 0xb2): __int64_t
    <74>   DW_AT_decl_file   : 3
    <75>   DW_AT_decl_line   : 47
    <76>   DW_AT_decl_column : 44
    <77>   DW_AT_type        : <0x7b>
 <1><7b>: Abbrev Number: 4 (DW_TAG_base_type)
    <7c>   DW_AT_byte_size   : 8
    <7d>   DW_AT_encoding    : 5	(signed)
    <7e>   DW_AT_name        : (indirect string, offset: 0xbc): long long int
 <1><82>: Abbrev Number: 4 (DW_TAG_base_type)
    <83>   DW_AT_byte_size   : 8
    <84>   DW_AT_encoding    : 7	(unsigned)
    <85>   DW_AT_name        : (indirect string, offset: 0x50): long long unsigned int
 <1><89>: Abbrev Number: 8 (DW_TAG_typedef)
    <8a>   DW_AT_name        : (indirect string, offset: 0): __off_t
    <8e>   DW_AT_decl_file   : 3
    <8f>   DW_AT_decl_line   : 152
    <90>   DW_AT_decl_column : 25
    <91>   DW_AT_type        : <0x6f>
 <1><95>: Abbrev Number: 8 (DW_TAG_typedef)
    <96>   DW_AT_name        : (indirect string, offset: 0x2c0): __off64_t
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 153
    <9c>   DW_AT_decl_column : 27
    <9d>   DW_AT_type        : <0x6f>
 <1><a1>: Abbrev Number: 4 (DW_TAG_base_type)
    <a2>   DW_AT_byte_size   : 4
    <a3>   DW_AT_encoding    : 5	(signed)
    <a4>   DW_AT_name        : (indirect string, offset: 0xc1): long int
 <1><a8>: Abbrev Number: 8 (DW_TAG_typedef)
    <a9>   DW_AT_name        : (indirect string, offset: 0x2f3): __time_t
    <ad>   DW_AT_decl_file   : 3
    <ae>   DW_AT_decl_line   : 160
    <af>   DW_AT_decl_column : 26
    <b0>   DW_AT_type        : <0x6f>
 <1><b4>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <b5>   DW_AT_byte_size   : 4
 <1><b6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b7>   DW_AT_byte_size   : 4
    <b7>   DW_AT_type        : <0xbb>
 <1><bb>: Abbrev Number: 4 (DW_TAG_base_type)
    <bc>   DW_AT_byte_size   : 1
    <bd>   DW_AT_encoding    : 8	(unsigned char)
    <be>   DW_AT_name        : (indirect string, offset: 0x275): char
 <1><c2>: Abbrev Number: 12 (DW_TAG_const_type)
    <c3>   DW_AT_type        : <0xbb>
 <1><c7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c8>   DW_AT_name        : (indirect string, offset: 0x212): _IO_FILE
    <cc>   DW_AT_byte_size   : 152
    <cd>   DW_AT_decl_file   : 4
    <ce>   DW_AT_decl_line   : 49
    <cf>   DW_AT_decl_column : 8
    <cf>   DW_AT_sibling     : <0x24d>
 <2><d3>: Abbrev Number: 2 (DW_TAG_member)
    <d4>   DW_AT_name        : (indirect string, offset: 0x107): _flags
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 51
    <da>   DW_AT_decl_column : 7
    <db>   DW_AT_type        : <0x63>
    <df>   DW_AT_data_member_location: 0
 <2><e0>: Abbrev Number: 2 (DW_TAG_member)
    <e1>   DW_AT_name        : (indirect string, offset: 0x8): _IO_read_ptr
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 54
    <e7>   DW_AT_decl_column : 9
    <e8>   DW_AT_type        : <0xb6>
    <ec>   DW_AT_data_member_location: 4
 <2><ed>: Abbrev Number: 2 (DW_TAG_member)
    <ee>   DW_AT_name        : (indirect string, offset: 0xfa): _IO_read_end
    <f2>   DW_AT_decl_file   : 4
    <f3>   DW_AT_decl_line   : 55
    <f4>   DW_AT_decl_column : 9
    <f5>   DW_AT_type        : <0xb6>
    <f9>   DW_AT_data_member_location: 8
 <2><fa>: Abbrev Number: 2 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0x2ca): _IO_read_base
    <ff>   DW_AT_decl_file   : 4
    <100>   DW_AT_decl_line   : 56
    <101>   DW_AT_decl_column : 9
    <102>   DW_AT_type        : <0xb6>
    <106>   DW_AT_data_member_location: 12
 <2><107>: Abbrev Number: 2 (DW_TAG_member)
    <108>   DW_AT_name        : (indirect string, offset: 0x339): _IO_write_base
    <10c>   DW_AT_decl_file   : 4
    <10d>   DW_AT_decl_line   : 57
    <10e>   DW_AT_decl_column : 9
    <10f>   DW_AT_type        : <0xb6>
    <113>   DW_AT_data_member_location: 16
 <2><114>: Abbrev Number: 2 (DW_TAG_member)
    <115>   DW_AT_name        : (indirect string, offset: 0x178): _IO_write_ptr
    <119>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 58
    <11b>   DW_AT_decl_column : 9
    <11c>   DW_AT_type        : <0xb6>
    <120>   DW_AT_data_member_location: 20
 <2><121>: Abbrev Number: 2 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x1e7): _IO_write_end
    <126>   DW_AT_decl_file   : 4
    <127>   DW_AT_decl_line   : 59
    <128>   DW_AT_decl_column : 9
    <129>   DW_AT_type        : <0xb6>
    <12d>   DW_AT_data_member_location: 24
 <2><12e>: Abbrev Number: 2 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x43): _IO_buf_base
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 60
    <135>   DW_AT_decl_column : 9
    <136>   DW_AT_type        : <0xb6>
    <13a>   DW_AT_data_member_location: 28
 <2><13b>: Abbrev Number: 2 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x10e): _IO_buf_end
    <140>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 61
    <142>   DW_AT_decl_column : 9
    <143>   DW_AT_type        : <0xb6>
    <147>   DW_AT_data_member_location: 32
 <2><148>: Abbrev Number: 2 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x199): _IO_save_base
    <14d>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 64
    <14f>   DW_AT_decl_column : 9
    <150>   DW_AT_type        : <0xb6>
    <154>   DW_AT_data_member_location: 36
 <2><155>: Abbrev Number: 2 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0x311): _IO_backup_base
    <15a>   DW_AT_decl_file   : 4
    <15b>   DW_AT_decl_line   : 65
    <15c>   DW_AT_decl_column : 9
    <15d>   DW_AT_type        : <0xb6>
    <161>   DW_AT_data_member_location: 40
 <2><162>: Abbrev Number: 2 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0x2d8): _IO_save_end
    <167>   DW_AT_decl_file   : 4
    <168>   DW_AT_decl_line   : 66
    <169>   DW_AT_decl_column : 9
    <16a>   DW_AT_type        : <0xb6>
    <16e>   DW_AT_data_member_location: 44
 <2><16f>: Abbrev Number: 2 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0x23c): _markers
    <174>   DW_AT_decl_file   : 4
    <175>   DW_AT_decl_line   : 68
    <176>   DW_AT_decl_column : 22
    <177>   DW_AT_type        : <0x266>
    <17b>   DW_AT_data_member_location: 48
 <2><17c>: Abbrev Number: 2 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x15): _chain
    <181>   DW_AT_decl_file   : 4
    <182>   DW_AT_decl_line   : 70
    <183>   DW_AT_decl_column : 20
    <184>   DW_AT_type        : <0x26b>
    <188>   DW_AT_data_member_location: 52
 <2><189>: Abbrev Number: 2 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0xe2): _fileno
    <18e>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 72
    <190>   DW_AT_decl_column : 7
    <191>   DW_AT_type        : <0x63>
    <195>   DW_AT_data_member_location: 56
 <2><196>: Abbrev Number: 2 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x1b5): _flags2
    <19b>   DW_AT_decl_file   : 4
    <19c>   DW_AT_decl_line   : 73
    <19d>   DW_AT_decl_column : 7
    <19e>   DW_AT_type        : <0x63>
    <1a2>   DW_AT_data_member_location: 60
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x144): _old_offset
    <1a8>   DW_AT_decl_file   : 4
    <1a9>   DW_AT_decl_line   : 74
    <1aa>   DW_AT_decl_column : 11
    <1ab>   DW_AT_type        : <0x89>
    <1af>   DW_AT_data_member_location: 64
 <2><1b0>: Abbrev Number: 2 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x11a): _cur_column
    <1b5>   DW_AT_decl_file   : 4
    <1b6>   DW_AT_decl_line   : 77
    <1b7>   DW_AT_decl_column : 18
    <1b8>   DW_AT_type        : <0x47>
    <1bc>   DW_AT_data_member_location: 72
 <2><1bd>: Abbrev Number: 2 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x2a5): _vtable_offset
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 78
    <1c4>   DW_AT_decl_column : 15
    <1c5>   DW_AT_type        : <0x55>
    <1c9>   DW_AT_data_member_location: 74
 <2><1ca>: Abbrev Number: 2 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x2d): _shortbuf
    <1cf>   DW_AT_decl_file   : 4
    <1d0>   DW_AT_decl_line   : 79
    <1d1>   DW_AT_decl_column : 8
    <1d2>   DW_AT_type        : <0x270>
    <1d6>   DW_AT_data_member_location: 75
 <2><1d7>: Abbrev Number: 2 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x1a7): _lock
    <1dc>   DW_AT_decl_file   : 4
    <1dd>   DW_AT_decl_line   : 81
    <1de>   DW_AT_decl_column : 15
    <1df>   DW_AT_type        : <0x280>
    <1e3>   DW_AT_data_member_location: 76
 <2><1e4>: Abbrev Number: 2 (DW_TAG_member)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x148): _offset
    <1e9>   DW_AT_decl_file   : 4
    <1ea>   DW_AT_decl_line   : 89
    <1eb>   DW_AT_decl_column : 13
    <1ec>   DW_AT_type        : <0x95>
    <1f0>   DW_AT_data_member_location: 80
 <2><1f1>: Abbrev Number: 2 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x134): _codecvt
    <1f6>   DW_AT_decl_file   : 4
    <1f7>   DW_AT_decl_line   : 91
    <1f8>   DW_AT_decl_column : 23
    <1f9>   DW_AT_type        : <0x28a>
    <1fd>   DW_AT_data_member_location: 88
 <2><1fe>: Abbrev Number: 2 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x287): _wide_data
    <203>   DW_AT_decl_file   : 4
    <204>   DW_AT_decl_line   : 92
    <205>   DW_AT_decl_column : 25
    <206>   DW_AT_type        : <0x294>
    <20a>   DW_AT_data_member_location: 92
 <2><20b>: Abbrev Number: 2 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x326): _freeres_list
    <210>   DW_AT_decl_file   : 4
    <211>   DW_AT_decl_line   : 93
    <212>   DW_AT_decl_column : 20
    <213>   DW_AT_type        : <0x26b>
    <217>   DW_AT_data_member_location: 96
 <2><218>: Abbrev Number: 2 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0x163): _freeres_buf
    <21d>   DW_AT_decl_file   : 4
    <21e>   DW_AT_decl_line   : 94
    <21f>   DW_AT_decl_column : 9
    <220>   DW_AT_type        : <0xb4>
    <224>   DW_AT_data_member_location: 100
 <2><225>: Abbrev Number: 2 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x2ec): __pad5
    <22a>   DW_AT_decl_file   : 4
    <22b>   DW_AT_decl_line   : 95
    <22c>   DW_AT_decl_column : 10
    <22d>   DW_AT_type        : <0x2d>
    <231>   DW_AT_data_member_location: 104
 <2><232>: Abbrev Number: 2 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0x1bd): _mode
    <237>   DW_AT_decl_file   : 4
    <238>   DW_AT_decl_line   : 96
    <239>   DW_AT_decl_column : 7
    <23a>   DW_AT_type        : <0x63>
    <23e>   DW_AT_data_member_location: 108
 <2><23f>: Abbrev Number: 2 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x2fc): _unused2
    <244>   DW_AT_decl_file   : 4
    <245>   DW_AT_decl_line   : 98
    <246>   DW_AT_decl_column : 8
    <247>   DW_AT_type        : <0x299>
    <24b>   DW_AT_data_member_location: 112
 <2><24c>: Abbrev Number: 0
 <1><24d>: Abbrev Number: 8 (DW_TAG_typedef)
    <24e>   DW_AT_name        : (indirect string, offset: 0x216): FILE
    <252>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 7
    <254>   DW_AT_decl_column : 25
    <255>   DW_AT_type        : <0xc7>
 <1><259>: Abbrev Number: 29 (DW_TAG_typedef)
    <25a>   DW_AT_name        : (indirect string, offset: 0x1fe): _IO_lock_t
    <25e>   DW_AT_decl_file   : 4
    <25f>   DW_AT_decl_line   : 43
    <260>   DW_AT_decl_column : 14
 <1><261>: Abbrev Number: 16 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0x158): _IO_marker
    <266>   DW_AT_declaration : 1
 <1><266>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <267>   DW_AT_byte_size   : 4
    <267>   DW_AT_type        : <0x261>
 <1><26b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26c>   DW_AT_byte_size   : 4
    <26c>   DW_AT_type        : <0xc7>
 <1><270>: Abbrev Number: 13 (DW_TAG_array_type)
    <271>   DW_AT_type        : <0xbb>
    <275>   DW_AT_sibling     : <0x280>
 <2><279>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <27a>   DW_AT_type        : <0x39>
    <27e>   DW_AT_upper_bound : 0
 <2><27f>: Abbrev Number: 0
 <1><280>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <281>   DW_AT_byte_size   : 4
    <281>   DW_AT_type        : <0x259>
 <1><285>: Abbrev Number: 16 (DW_TAG_structure_type)
    <286>   DW_AT_name        : (indirect string, offset: 0x131): _IO_codecvt
    <28a>   DW_AT_declaration : 1
 <1><28a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <28b>   DW_AT_byte_size   : 4
    <28b>   DW_AT_type        : <0x285>
 <1><28f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <290>   DW_AT_name        : (indirect string, offset: 0x284): _IO_wide_data
    <294>   DW_AT_declaration : 1
 <1><294>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <295>   DW_AT_byte_size   : 4
    <295>   DW_AT_type        : <0x28f>
 <1><299>: Abbrev Number: 13 (DW_TAG_array_type)
    <29a>   DW_AT_type        : <0xbb>
    <29e>   DW_AT_sibling     : <0x2a9>
 <2><2a2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2a3>   DW_AT_type        : <0x39>
    <2a7>   DW_AT_upper_bound : 39
 <2><2a8>: Abbrev Number: 0
 <1><2a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2aa>   DW_AT_byte_size   : 4
    <2aa>   DW_AT_type        : <0x24d>
 <1><2ae>: Abbrev Number: 22 (DW_TAG_restrict_type)
    <2af>   DW_AT_type        : <0x2a9>
 <1><2b3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x29c): timespec
    <2b8>   DW_AT_byte_size   : 16
    <2b9>   DW_AT_decl_file   : 6
    <2ba>   DW_AT_decl_line   : 11
    <2bb>   DW_AT_decl_column : 8
    <2bb>   DW_AT_sibling     : <0x2da>
 <2><2bf>: Abbrev Number: 2 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x1e0): tv_sec
    <2c4>   DW_AT_decl_file   : 6
    <2c5>   DW_AT_decl_line   : 16
    <2c6>   DW_AT_decl_column : 12
    <2c7>   DW_AT_type        : <0xa8>
    <2cb>   DW_AT_data_member_location: 0
 <2><2cc>: Abbrev Number: 2 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x1d8): tv_nsec
    <2d1>   DW_AT_decl_file   : 6
    <2d2>   DW_AT_decl_line   : 27
    <2d3>   DW_AT_decl_column : 12
    <2d4>   DW_AT_type        : <0xa1>
    <2d8>   DW_AT_data_member_location: 8
 <2><2d9>: Abbrev Number: 0
 <1><2da>: Abbrev Number: 12 (DW_TAG_const_type)
    <2db>   DW_AT_type        : <0x2b3>
 <1><2df>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2e0>   DW_AT_byte_size   : 4
    <2e0>   DW_AT_type        : <0xc2>
 <1><2e4>: Abbrev Number: 22 (DW_TAG_restrict_type)
    <2e5>   DW_AT_type        : <0x2df>
 <1><2e9>: Abbrev Number: 30 (DW_TAG_variable)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xdb): blinky
    <2ee>   DW_AT_decl_file   : 1
    <2ef>   DW_AT_decl_line   : 12
    <2f0>   DW_AT_decl_column : 18
    <2f1>   DW_AT_type        : <0x6a>
    <2f5>   DW_AT_const_value : 440
 <1><2f7>: Abbrev Number: 23 (DW_TAG_variable)
    <2f8>   DW_AT_name        : fp
    <2fb>   DW_AT_decl_file   : 1
    <2fb>   DW_AT_decl_line   : 17
    <2fc>   DW_AT_decl_column : 14
    <2fd>   DW_AT_type        : <0x2a9>
    <301>   DW_AT_location    : 5 byte block: 3 44 40 1 0 	(DW_OP_addr: 14044)
 <1><307>: Abbrev Number: 9 (DW_TAG_variable)
    <308>   DW_AT_name        : (indirect string, offset: 0x252): time_dit
    <30c>   DW_AT_decl_file   : 1
    <30c>   DW_AT_decl_line   : 85
    <30d>   DW_AT_decl_column : 21
    <30d>   DW_AT_type        : <0x31a>
    <311>   DW_AT_const_value : 8 byte block: 1f 85 eb 51 b8 1e d5 3f 
 <1><31a>: Abbrev Number: 12 (DW_TAG_const_type)
    <31b>   DW_AT_type        : <0x26>
 <1><31f>: Abbrev Number: 9 (DW_TAG_variable)
    <320>   DW_AT_name        : (indirect string, offset: 0x1f5): time_dah
    <324>   DW_AT_decl_file   : 1
    <324>   DW_AT_decl_line   : 86
    <325>   DW_AT_decl_column : 21
    <325>   DW_AT_type        : <0x31a>
    <329>   DW_AT_const_value : 8 byte block: ae 47 e1 7a 14 ae ef 3f 
 <1><332>: Abbrev Number: 9 (DW_TAG_variable)
    <333>   DW_AT_name        : (indirect string, offset: 0x25b): time_space
    <337>   DW_AT_decl_file   : 1
    <337>   DW_AT_decl_line   : 88
    <338>   DW_AT_decl_column : 21
    <338>   DW_AT_type        : <0x31a>
    <33c>   DW_AT_const_value : 8 byte block: 1f 85 eb 51 b8 1e d5 3f 
 <1><345>: Abbrev Number: 9 (DW_TAG_variable)
    <346>   DW_AT_name        : (indirect string, offset: 0x21b): time_letter
    <34a>   DW_AT_decl_file   : 1
    <34a>   DW_AT_decl_line   : 90
    <34b>   DW_AT_decl_column : 21
    <34b>   DW_AT_type        : <0x31a>
    <34f>   DW_AT_const_value : 8 byte block: 1f 85 eb 51 b8 1e e5 3f 
 <1><358>: Abbrev Number: 9 (DW_TAG_variable)
    <359>   DW_AT_name        : (indirect string, offset: 0x1c): time_word
    <35d>   DW_AT_decl_file   : 1
    <35d>   DW_AT_decl_line   : 92
    <35e>   DW_AT_decl_column : 21
    <35e>   DW_AT_type        : <0x31a>
    <362>   DW_AT_const_value : 8 byte block: 1f 85 eb 51 b8 1e f5 3f 
 <1><36b>: Abbrev Number: 13 (DW_TAG_array_type)
    <36c>   DW_AT_type        : <0x2df>
    <370>   DW_AT_sibling     : <0x37b>
 <2><374>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <375>   DW_AT_type        : <0x39>
    <379>   DW_AT_upper_bound : 35
 <2><37a>: Abbrev Number: 0
 <1><37b>: Abbrev Number: 24 (DW_TAG_variable)
    <37c>   DW_AT_name        : (indirect string, offset: 0x292): morse_tbl
    <380>   DW_AT_decl_file   : 1
    <380>   DW_AT_decl_line   : 100
    <381>   DW_AT_decl_column : 20
    <382>   DW_AT_type        : <0x36b>
    <386>   DW_AT_location    : 5 byte block: 3 20 b 1 0 	(DW_OP_addr: 10b20)
 <1><38c>: Abbrev Number: 10 (DW_TAG_subprogram)
    <38d>   DW_AT_external    : 1
    <38d>   DW_AT_name        : (indirect string, offset: 0x67): nanosleep
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 281
    <394>   DW_AT_decl_column : 12
    <395>   DW_AT_prototyped  : 1
    <395>   DW_AT_type        : <0x63>
    <399>   DW_AT_declaration : 1
    <399>   DW_AT_sibling     : <0x3a8>
 <2><39d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <39e>   DW_AT_type        : <0x3a8>
 <2><3a2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3a3>   DW_AT_type        : <0x3ad>
 <2><3a7>: Abbrev Number: 0
